eisup_2019_docmng_integration/src/Catalogs/абс_ПоказателиДляПремий/абс_ПоказателиДляПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_ПоказателиДляПремий</name>
  <attributes>
    <name>ВидПоказателя</name>
    <type>
      <types>EnumRef.ВидыПоказателейСхемМотивации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоказателя</name>
    <type>
      <types>EnumRef.абс_ВидыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстМодуля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыполнения</name>
    <type>
      <types>EnumRef.абс_ВидыВыполненияМодулей</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПоследнийИзменивший</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяКПЭ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитикиКПЭ</name>
    <type>
      <types>EnumRef.абс_ВидыАналитикиЗначенийПоказателейКПЭ</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчетаКПЭ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоВыражение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запросы</name>
    <attributes>
      <name>ИмяЗапроса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстЗапроса</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Enums/абс_ВидыПоказателей/абс_ВидыПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыПоказателей</name>
  <enumValues>
    <name>Алгоритмом</name>
  </enumValues>
  <enumValues>
    <name>Вручную</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/ПоказателиСхемМотивации/ПоказателиСхемМотивации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПоказателиСхемМотивации</name>
  <predefined>
    <items>
      <name>ВремяВДнях</name>
      <description>Время в днях</description>
    </items>
    <items>
      <name>ВремяВКалендарныхДнях</name>
      <description>Время в календарных днях</description>
    </items>
    <items>
      <name>ВремяВЧасах</name>
      <description>Время в часах</description>
    </items>
    <items>
      <name>КалендарныхДнейВмесяце</name>
      <description>Календарных дней в месяце</description>
    </items>
    <items>
      <name>УдалитьНуль</name>
      <description>Не использовать (оставлен для преемственности с версией 2.5.5 и ниже)</description>
    </items>
    <items>
      <name>НормаВремениВДнях</name>
      <description>Норма времени в днях</description>
    </items>
    <items>
      <name>НормаВремениВЧасах</name>
      <description>Норма времени в часах</description>
    </items>
    <items>
      <name>ОтработаноВремениВДнях</name>
      <description>Отработано времени в днях</description>
    </items>
    <items>
      <name>ОтработаноВремениВЧасах</name>
      <description>Отработано времени в часах</description>
    </items>
    <items>
      <name>РасчетнаяБаза</name>
      <description>Расчетная база</description>
    </items>
    <items>
      <name>СдельнаяВыработка</name>
      <description>Сдельная выработка</description>
    </items>
    <items>
      <name>Стаж</name>
      <description>Стаж работы</description>
    </items>
    <items>
      <name>ТарифнаяСтавкаДневная</name>
      <description>Тарифная ставка дневная</description>
    </items>
    <items>
      <name>ТарифнаяСтавкаМесячная</name>
      <description>Тарифная ставка месячная</description>
    </items>
    <items>
      <name>ТарифнаяСтавкаЧасовая</name>
      <description>Тарифная ставка часовая</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипПоказателя</name>
    <type>
      <types>EnumRef.ТипыПоказателейСхемМотивации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозможностьИзменения</name>
    <type>
      <types>EnumRef.ИзменениеПоказателейСхемМотивации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоказателя</name>
    <type>
      <types>EnumRef.ВидыПоказателейСхемМотивации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательЭффективности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифнаяСтавка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийПоказатель</name>
    <type>
      <types>CatalogRef.ПоказателиСхемМотивации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаСуммы</name>
    <type>
      <types>EnumRef.СпособыРасчетаСуммыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммируемыйПоказатель</name>
    <type>
      <types>CatalogRef.ПоказателиСхемМотивации</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтажа</name>
    <type>
      <types>CatalogRef.ВидыСтажа</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Catalogs/абс_ПоказателиДляПремий/ManagerModule.bsl
Функция РассчитатьПоказатель(Знач Период, Показатель, Знач Сотрудник, Знач НачалоПериода, Знач КонецПериода, Знач МесяцНачисления, СсылкаНаДокумент, Знач Месяц = 0, Знач ДатаНачала,Знач ДатаОкончания, Знач ТаблицаПоказателейПоСотруднику) Экспорт 
	
	Значение = 0;
	
	Если ТипЗнч(Показатель) = Тип("СправочникСсылка.ПоказателиСхемМотивации") Тогда 
		
		Попытка
			Выполнить(Показатель.абс_АлгоритмРасчета);
		Исключение
			ОбщегоНазначенияЗК.СообщитьОбОшибке(ОписаниеОшибки());
		КонецПопытки;
		
	Иначе 
	
		Если Показатель.ТипПоказателя = Перечисления.абс_ВидыПоказателей.Вручную Тогда 
			
			//Запрос = Новый Запрос(
			//"ВЫБРАТЬ ПЕРВЫЕ 1
			//|	абс_ЗначенияПоказателейСрезПоследних.Значение
			//|ИЗ
			//|	РегистрСведений.абс_ЗначенияПоказателей.СрезПоследних(
			//|			&Период,
			//|			Сотрудник = &Сотрудник
			//|				И Показатель = &Показатель) КАК абс_ЗначенияПоказателейСрезПоследних");
			//Запрос.УстановитьПараметр("Период", Период);
			//Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
			//Запрос.УстановитьПараметр("Показатель", Показатель);
			//
			//Выборка = Запрос.Выполнить().Выбрать();
			//Если Выборка.Следующий() Тогда 
			//	Значение = Выборка.Значение;
			//КонецЕсли;
		
		Иначе 
			
			Попытка
				
				ОбъектПоказатель = Показатель.ПолучитьОбъект();
				
				ОбъектПоказатель.Период 			= Период;  
				ОбъектПоказатель.Показатель 		= Показатель; 
				ОбъектПоказатель.Сотрудник 			= Сотрудник; 
				ОбъектПоказатель.НачалоПериода 		= НачалоПериода; 
				ОбъектПоказатель.КонецПериода 		= КонецПериода; 
				ОбъектПоказатель.МесяцНачисления 	= МесяцНачисления;
				ОбъектПоказатель.СсылкаНаДокумент 	= СсылкаНаДокумент;
				ОбъектПоказатель.Значение 			= Значение;
				ОбъектПоказатель.Месяц	 			= Месяц;
				ОбъектПоказатель.ДатаНачала			= ДатаНачала;
				ОбъектПоказатель.ДатаОкончания		= ДатаОкончания;
				ОбъектПоказатель.ТаблицаПоказателейПоСотруднику = ТаблицаПоказателейПоСотруднику;
				ОбъектПоказатель.ВыполнитьМодуль();
				
				Значение = ОбъектПоказатель.Значение;
				
			Исключение
				ОбщегоНазначенияЗК.СообщитьОбОшибке(ОписаниеОшибки());
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция НайтиПоказатель(Идентификатор) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПоказателиСхемМотивации.Ссылка
	|ИЗ
	|	Справочник.ПоказателиСхемМотивации КАК ПоказателиСхемМотивации
	|ГДЕ
	|	ПоказателиСхемМотивации.Идентификатор = &Идентификатор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	абс_ПоказателиДляПремий.Ссылка
	|ИЗ
	|	Справочник.абс_ПоказателиДляПремий КАК абс_ПоказателиДляПремий
	|ГДЕ
	|	абс_ПоказателиДляПремий.Идентификатор = &Идентификатор");
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	Иначе 
		Возврат Справочники.ПоказателиСхемМотивации.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция ПроверитьАлгоритм(Показатель) Экспорт 
	
	Период = ТекущаяДата();
	Выборка = Справочники.СотрудникиОрганизаций.Выбрать();
	Выборка.Следующий();
	Сотрудник = Выборка.Ссылка;
	АлгоритмРаботает = Истина;
	НачалоПериода = НачалоМесяца(ТекущаяДата());
	КонецПериода = КонецМесяца(ТекущаяДата());
	МесяцНачисления = НачалоПериода;
	Месяц = 0;
	
	
	Значение = 0;
	
	Если ТипЗнч(Показатель) = Тип("СправочникСсылка.ПоказателиСхемМотивации") Тогда 
		
			Попытка
				Выполнить(Показатель.абс_АлгоритмРасчета);
			Исключение
				ОбщегоНазначенияЗК.СообщитьОбОшибке(ОписаниеОшибки());
				АлгоритмРаботает = Ложь;
			КонецПопытки;
		
	Иначе 
	
		Если Показатель.ТипПоказателя = Перечисления.абс_ВидыПоказателей.Вручную Тогда 
			// Заполняет пользователь
		Иначе 
			
			Попытка
				
				ОбъектПоказатель = Показатель.ПолучитьОбъект();
				
				ОбъектПоказатель.Период = Период;  
				ОбъектПоказатель.Показатель = Показатель; 
				ОбъектПоказатель.Сотрудник = Сотрудник; 
				ОбъектПоказатель.НачалоПериода = НачалоПериода; 
				ОбъектПоказатель.КонецПериода = КонецПериода; 
				ОбъектПоказатель.МесяцНачисления = МесяцНачисления;
				ОбъектПоказатель.Значение = Значение;
				
				ОбъектПоказатель.ВыполнитьМодуль();
				
				Значение = ОбъектПоказатель.Значение;
				
			Исключение
				ОбщегоНазначенияЗК.СообщитьОбОшибке(ОписаниеОшибки());
				АлгоритмРаботает = Ложь;
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат АлгоритмРаботает;
	
КонецФункции
